Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
e created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Kube-Proxy unavailable alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "168"
              + "__dashboardUid__" = "bj5-ZEhWk"
              + "__panelId__"      = "2"
              + "message"          = "One more instances of kube-proxy are unavailable! Please see \"Kubernetes Components\" dashboard for more details."
            }
          + condition      = "A"
          + exec_err_state = "Alerting"
          + for            = "1m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "ac76e773-f347-4e27-b67a-e3308cfe1395"
            }
          + name           = "Kube-Proxy unavailable alert"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0.5,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "B",
                                    ]
                                }
                              + reducer   = {
                                  + type = "avg"
                                }
                            },
                        ]
                      + refId      = "A"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + expr           = "sum by (daemonset) (kube_daemonset_status_desired_number_scheduled{namespace=\"kube-system\", daemonset=\"kube-proxy\"}) - sum by (daemonset) (kube_daemonset_status_number_available{namespace=\"kube-system\", daemonset=\"kube-proxy\"})"
                      + format         = "time_series"
                      + intervalFactor = 2
                      + legendFormat   = "Unavailable"
                      + refId          = "B"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Memory Capacity Utilization Alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Memory Capacity Utilization Alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "158"
              + "__dashboardUid__" = "s_zMzas4z"
              + "__panelId__"      = "6"
              + "message"          = "Elevated memory capacity utilization"
            }
          + condition      = "A"
          + exec_err_state = "Alerting"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "ce530e1d-3432-4807-8f29-5e3c984c542c"
            }
          + name           = "Memory Capacity Utilization Alert"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0.85,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "C",
                                    ]
                                }
                              + reducer   = {
                                  + type = "avg"
                                }
                            },
                        ]
                      + refId      = "A"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + datasource   = {
                          + type = "prometheus"
                          + uid  = "prometheus"
                        }
                      + editorMode   = "code"
                      + expr         = "sum(namespace_memory:kube_pod_container_resource_requests:sum{}) / sum(kube_node_status_allocatable{resource=\"memory\"})"
                      + legendFormat = "Memory Capacity Utilization"
                      + range        = true
                      + refId        = "C"
                    }
                )
              + ref_id         = "C"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Misuse of priority classes.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Misuse of priority classes"

      + rule {
          + annotations    = {
              + "__alertId__"      = "175"
              + "__dashboardUid__" = "W8nct6zGz"
              + "__panelId__"      = "6"
              + "message"          = "Misuse of priority classes detected"
            }
          + condition      = "B"
          + exec_err_state = "Alerting"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "add33528-1eaa-4d5d-af5b-3de4b93f5a42"
            }
          + name           = "Misuse of priority classes"
          + no_data_state  = "OK"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + expr           = "count(kube_pod_info{priority_class=\"selfservice\", namespace!=\"selfservice\", namespace!=\"selfservice-herald-vbqkr\", namespace!=\"developerautomation-xavgy\", namespace!=\"velero\"}) by (pririty_class, namespace)"
                      + format         = "time_series"
                      + interval       = ""
                      + intervalFactor = 1
                      + legendFormat   = "Selfservice priority class"
                      + refId          = "A"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 3600
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0.5,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "A",
                                    ]
                                }
                              + reducer   = {
                                  + type = "avg"
                                }
                            },
                        ]
                      + refId      = "B"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/NodeNotReady.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "NodeNotReady"

      + rule {
          + annotations    = {
              + "__alertId__"      = "173"
              + "__dashboardUid__" = "KbpocXAVk"
              + "__panelId__"      = "3"
              + "message"          = "One or more nodes are in a NotReady state"
            }
          + condition      = "A"
          + exec_err_state = "Alerting"
          + for            = "1m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "c9a6b483-1488-4fe5-a790-1ff7445436bb"
            }
          + name           = "NodeNotReady"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "E",
                                    ]
                                }
                              + reducer   = {
                                  + type = "avg"
                                }
                            },
                        ]
                      + refId      = "A"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + datasource   = {
                          + type = "prometheus"
                          + uid  = "prometheus"
                        }
                      + editorMode   = "code"
                      + expr         = "sum(kube_node_status_condition{condition=\"Ready\",status!=\"true\"})"
                      + legendFormat = "__auto"
                      + range        = true
                      + refId        = "E"
                    }
                )
              + ref_id         = "E"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Nodes by state alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Nodes by state alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "172"
              + "__dashboardUid__" = "KbpocXAVk"
              + "__panelId__"      = "2"
              + "message"          = "Nodes found in the \"not ready\" state."
            }
          + condition      = "A"
          + exec_err_state = "Alerting"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "ba0847b8-e010-4877-a43e-d64b9ec085dc"
            }
          + name           = "Nodes by state alert"
          + no_data_state  = "OK"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "B",
                                    ]
                                }
                              + reducer   = {
                                  + type = "last"
                                }
                            },
                        ]
                      + refId      = "A"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + datasource   = {
                          + type = "prometheus"
                          + uid  = "prometheus"
                        }
                      + editorMode   = "code"
                      + exemplar     = true
                      + expr         = "sum(kube_node_status_condition{condition=~\"NotReady\"})"
                      + interval     = ""
                      + legendFormat = "Not Ready"
                      + range        = true
                      + refId        = "B"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Pod Capacity Utilization Alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Pod Capacity Utilization Alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "156"
              + "__dashboardUid__" = "s_zMzas4z"
              + "__panelId__"      = "2"
              + "message"          = "Elevated pod capacity utilization"
            }
          + condition      = "A"
          + exec_err_state = "Alerting"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "f1593d7d-79b2-4542-9944-a7f65411bf5b"
            }
          + name           = "Pod Capacity Utilization Alert"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0.85,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "C",
                                    ]
                                }
                              + reducer   = {
                                  + type = "last"
                                }
                            },
                        ]
                      + refId      = "A"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + datasource   = {
                          + type = "prometheus"
                          + uid  = "prometheus"
                        }
                      + editorMode   = "code"
                      + expr         = "count(kube_pod_info)/sum(kube_node_status_capacity{resource=\"pods\"})"
                      + legendFormat = "Pod Capacity Utilization"
                      + range        = true
                      + refId        = "C"
                    }
                )
              + ref_id         = "C"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Priority Classes alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Priority Classes alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "154"
              + "__dashboardUid__" = "axdphXDZz"
              + "__panelId__"      = "10"
              + "message"          = "Unauthorised Use of Reserved Priority Classes"
            }
          + condition      = "E"
          + exec_err_state = "Alerting"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "eecf4258-4c13-4ff6-a614-24254d8fb5af"
            }
          + name           = "Priority Classes alert"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + expr           = "count(kube_pod_info{priority_class=~\"system.*\",namespace!~\"kube-system|monitoring|flux-system|nvidia-device-plugin|metrics-server\"}) OR on() vector(0)"
                      + format         = "time_series"
                      + intervalFactor = 2
                      + legendFormat   = "system*"
                      + refId          = "A"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + expr           = "count(kube_pod_info{priority_class=~\"service-critical\",namespace!~\"kube-system|velero\"}) OR on() vector(0)"
                      + format         = "time_series"
                      + interval       = ""
                      + intervalFactor = 2
                      + legendFormat   = "service-critical"
                      + refId          = "B"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + expr           = "count(kube_pod_info{priority_class=~\"cluster-monitoring\",namespace!~\"kube-system|monitoring|goldpinger|grafana|fluentd\"}) OR on() vector(0)"
                      + format         = "time_series"
                      + interval       = ""
                      + intervalFactor = 2
                      + legendFormat   = "cluster-monitoring"
                      + refId          = "C"
                    }
                )
              + ref_id         = "C"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + expr           = "count(kube_pod_info{priority_class=~\"selfservice\",namespace!~\"selfservice|selfservice-herald-vbqkr|developerautomation-xavgy\"}) OR on() vector(0)"
                      + format         = "time_series"
                      + interval       = ""
                      + intervalFactor = 2
                      + legendFormat   = "selfservice"
                      + refId          = "D"
                    }
                )
              + ref_id         = "D"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "A",
                                    ]
                                }
                              + reducer   = {
                                  + type = "last"
                                }
                            },
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "or"
                                }
                              + query     = {
                                  + params = [
                                      + "B",
                                    ]
                                }
                              + reducer   = {
                                  + type = "last"
                                }
                            },
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "or"
                                }
                              + query     = {
                                  + params = [
                                      + "C",
                                    ]
                                }
                              + reducer   = {
                                  + type = "last"
                                }
                            },
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "or"
                                }
                              + query     = {
                                  + params = [
                                      + "D",
                                    ]
                                }
                              + reducer   = {
                                  + type = "last"
                                }
                            },
                        ]
                      + refId      = "E"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "E"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Restore Validation Failure alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Restore Validation Failure alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "182"
              + "__dashboardUid__" = "YAniUGC"
              + "__panelId__"      = "33"
              + "message"          = "Validation of a velero restore has failed.  Please use the Velero CLI to retrieve the logs to assist in investigation of the issue."
            }
          + condition      = "B"
          + exec_err_state = "Alerting"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "a7ee5231-ac93-4e57-8991-8a18a8abe37f"
            }
          + name           = "Restore Validation Failure alert"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + expr         = "rate(velero_restore_validation_failed_total{schedule=~\"velero-hellman-cluster-backup\"}[24h:])  "
                      + interval     = ""
                      + legendFormat = ""
                      + refId        = "A"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "A",
                                    ]
                                }
                              + reducer   = {
                                  + type = "last"
                                }
                            },
                        ]
                      + refId      = "B"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/SSL expiry alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 1440
      + name               = "SSL expiry alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "177"
              + "__dashboardUid__" = "bXDq_ZNnz"
              + "__panelId__"      = "192"
              + "message"          = ""
            }
          + condition      = "B"
          + exec_err_state = "Alerting"
          + for            = "1h"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "ed7bcdc2-07d7-4c4e-9cdd-e6580fb69fce"
            }
          + name           = "SSL expiry alert"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + exemplar     = true
                      + expr         = "probe_ssl_earliest_cert_expiry{} - time()"
                      + interval     = ""
                      + legendFormat = "{{ instance }}"
                      + refId        = "A"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 3600
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 2592000,
                                    ]
                                  + type   = "lt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "A",
                                    ]
                                }
                              + reducer   = {
                                  + type = "avg"
                                }
                            },
                        ]
                      + refId      = "B"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Sockets used per node alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Sockets used per node alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "174"
              + "__dashboardUid__" = "GGodmXAVz"
              + "__panelId__"      = "2"
              + "message"          = "Sockets used per node has reached an unusually high level."
            }
          + condition      = "A"
          + exec_err_state = "Alerting"
          + for            = "15m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "e5600b97-49cc-4daa-9016-5bae3c84a365"
            }
          + name           = "Sockets used per node alert"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "E",
                                    ]
                                }
                              + reducer   = {
                                  + type = "avg"
                                }
                            },
                        ]
                      + refId      = "A"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + datasource   = {
                          + type = "prometheus"
                          + uid  = "prometheus"
                        }
                      + editorMode   = "code"
                      + exemplar     = true
                      + expr         = "avg(node_sockstat_sockets_used{}) - (avg_over_time(avg(node_sockstat_sockets_used{})[24h:1m]) + 3 * stddev_over_time(avg(node_sockstat_sockets_used{})[24h:1m]))"
                      + instant      = false
                      + interval     = ""
                      + legendFormat = "alert"
                      + refId        = "E"
                    }
                )
              + ref_id         = "E"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Subnet IP usage alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Subnet IP usage alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "153"
              + "__dashboardUid__" = "1NxY8ypGk"
              + "__panelId__"      = "2"
              + "message"          = "One or more subnets has a low count of available IP's < 500."
            }
          + condition      = "B"
          + exec_err_state = "Alerting"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "a3f8e90a-b38b-4244-9d38-c70cfe05d477"
            }
          + name           = "Subnet IP usage alert"
          + no_data_state  = "OK"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + expr         = "sum by(tag, subnetid) (aws_subnet_exporter_available_ip{tag=~\".*eu.*\"}) "
                      + interval     = ""
                      + legendFormat = "availableIP:{{tag}}"
                      + refId        = "A"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 3600
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 500,
                                    ]
                                  + type   = "lt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "A",
                                    ]
                                }
                              + reducer   = {
                                  + type = "avg"
                                }
                            },
                        ]
                      + refId      = "B"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Topic has large amount of consumergroups.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Topic has large amount of consumergroups"

      + rule {
          + annotations    = {
              + "__alertId__"      = "166"
              + "__dashboardUid__" = "CoYn_3-nk"
              + "__panelId__"      = "4"
              + "message"          = "A topic has large amount of consumergroups. This might be due to someone creating unique consumergroups and hence eventually taking down the exporter for everybody, due to long request times."
            }
          + condition      = "B"
          + exec_err_state = "Alerting"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "c65dff93-ab8b-4f37-9670-e12fe4f26c75"
            }
          + name           = "Topic has large amount of consumergroups"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + datasource   = {
                          + type = "prometheus"
                          + uid  = "prometheus"
                        }
                      + exemplar     = true
                      + expr         = "count(kafka_consumergroup_lag) by (topic)"
                      + interval     = ""
                      + legendFormat = "{{topic}}"
                      + refId        = "A"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 150,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "A",
                                    ]
                                }
                              + reducer   = {
                                  + type = "avg"
                                }
                            },
                        ]
                      + refId      = "B"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/VPC CNI unavailable alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "VPC CNI unavailable alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "170"
              + "__dashboardUid__" = "bj5-ZEhWk"
              + "__panelId__"      = "4"
              + "message"          = "One more instances of VPC CNI are unavailable! Please see \"Kubernetes Components\" dashboard for more details."
            }
          + condition      = "A"
          + exec_err_state = "Alerting"
          + for            = "1m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "c8f6677c-18dc-423a-bc2a-191514348b6f"
            }
          + name           = "VPC CNI unavailable alert"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0.5,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "B",
                                    ]
                                }
                              + reducer   = {
                                  + type = "avg"
                                }
                            },
                        ]
                      + refId      = "A"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + expr           = "sum by (daemonset) (kube_daemonset_status_desired_number_scheduled{namespace=\"kube-system\", daemonset=\"aws-node\"}) - sum by (daemonset) (kube_daemonset_status_number_available{namespace=\"kube-system\", daemonset=\"aws-node\"})"
                      + format         = "time_series"
                      + intervalFactor = 2
                      + legendFormat   = "Unavailable"
                      + refId          = "B"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Version alerts alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Version alerts alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "161"
              + "__dashboardUid__" = "YMBzktpGz"
              + "__panelId__"      = "15"
              + "message"          = "Current Kubernetes cluster version is outdated"
            }
          + condition      = "B"
          + exec_err_state = "Alerting"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "repeat"   = "24h"
              + "rule_uid" = "b3144065-3094-4403-93dd-b7037b9f563d"
            }
          + name           = "Version alerts alert"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + datasource     = {
                          + type = "prometheus"
                          + uid  = "prometheus"
                        }
                      + expr           = "eks_version_exporter_is_outdated"
                      + format         = "time_series"
                      + instant        = false
                      + intervalFactor = 1
                      + legendFormat   = "is_outdated"
                      + refId          = "A"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 60
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0.9,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "A",
                                    ]
                                }
                              + reducer   = {
                                  + type = "last"
                                }
                            },
                        ]
                      + refId      = "B"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Volume Snapshot Failure alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Volume Snapshot Failure alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "183"
              + "__dashboardUid__" = "YAniUGC"
              + "__panelId__"      = "34"
              + "message"          = "A volume snapshot using Velero has failed.  Please check Velero to establish the cause of the failure."
            }
          + condition      = "B"
          + exec_err_state = "Alerting"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "b8eaf085-5c81-4d2a-b4a7-f2c6c9998e66"
            }
          + name           = "Volume Snapshot Failure alert"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + expr         = "rate(velero_volume_snapshot_failure_total{schedule=~\"velero-hellman-cluster-backup\"}[24h:])  "
                      + interval     = ""
                      + legendFormat = ""
                      + refId        = "A"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "A",
                                    ]
                                }
                              + reducer   = {
                                  + type = "last"
                                }
                            },
                        ]
                      + refId      = "B"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Watchdog.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 300
      + name               = "Watchdog"

      + rule {
          + condition      = "C"
          + exec_err_state = "Error"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "repeat" = "24h"
            }
          + name           = "Watchdog"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + editorMode = "code"
                      + expr       = "vector(1)"
                      + hide       = false
                      + instant    = true
                      + range      = false
                      + refId      = "A"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 600
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = []
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "B",
                                    ]
                                }
                              + reducer   = {
                                  + params = []
                                  + type   = "last"
                                }
                              + type      = "query"
                            },
                        ]
                      + datasource = {
                          + type = "__expr__"
                          + uid  = "__expr__"
                        }
                      + expression = "A"
                      + hide       = false
                      + reducer    = "last"
                      + refId      = "B"
                      + type       = "reduce"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 600
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "C",
                                    ]
                                }
                              + reducer   = {
                                  + params = []
                                  + type   = "last"
                                }
                              + type      = "query"
                            },
                        ]
                      + datasource = {
                          + type = "__expr__"
                          + uid  = "__expr__"
                        }
                      + expression = "B"
                      + hide       = false
                      + refId      = "C"
                      + type       = "threshold"
                    }
                )
              + ref_id         = "C"

              + relative_time_range {
                  + from = 600
                  + to   = 0
                }
            }
        }
    }

  # module.ce_folder.grafana_folder.this will be destroyed
  # (because module.ce_folder is not in configuration)
  - resource "grafana_folder" "this" {
      - id                           = "0:b934e728-bb75-170b-83e7-024c5bdd6e61" -> null
      - org_id                       = "0" -> null
      - prevent_destroy_if_not_empty = false -> null
      - title                        = "Cloud Engineering" -> null
      - uid                          = "b934e728-bb75-170b-83e7-024c5bdd6e61" -> null
      - url                          = "https://demo.grafana.dfds.cloud/dashboards/f/b934e728-bb75-170b-83e7-024c5bdd6e61/cloud-engineering" -> null
    }

  # module.ce_folder.random_uuid.this will be destroyed
  # (because module.ce_folder is not in configuration)
  - resource "random_uuid" "this" {
      - id     = "b934e728-bb75-170b-83e7-024c5bdd6e61" -> null
      - result = "b934e728-bb75-170b-83e7-024c5bdd6e61" -> null
    }

  # module.ce_folder[0].grafana_folder.this will be created
  + resource "grafana_folder" "this" {
      + id                           = (known after apply)
      + prevent_destroy_if_not_empty = false
      + title                        = "Cloud Engineering"
      + uid                          = (known after apply)
      + url                          = (known after apply)
    }

  # module.ce_folder[0].random_uuid.this will be created
  + resource "random_uuid" "this" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.dashboards.grafana_dashboard.this["dashboards/1password-metrics.json"] will be destroyed
  # (because module.dashboards is not in configuration)
  - resource "grafana_dashboard" "this" {
      - config_json  = jsonencode(
            {
              - annotations                      = {
                  - list = [
                      - {
                          - builtIn    = 1
                          - datasource = {
                              - type = "datasource"
                              - uid  = "grafana"
                            }
                          - enable     = true
                          - hide       = true
                          - iconColor  = "rgba(0, 211, 255, 1)"
                          - name       = "Annotations & Alerts"
                          - target     = {
                              - limit    = 100
                              - matchAny = false
                              - tags     = []
                              - type     = "dashboard"
                            }
                          - type       = "dashboard"
                        },
                    ]
                }
              - description                      = ""
              - editable                         = true
              - fiscalYearStartMonth             = 0
              - graphTooltip                     = 0
              - links                            = []
              - liveNow                          = false
              - panels                           = [
                  - {
                      - datasource      = {
                          - type = "grafana-athena-datasource"
                          - uid  = "${datasource}"
                        }
                      - fieldConfig     = {
                          - defaults  = {
                              - color      = {
                                  - mode = "palette-classic"
                                }
                              - custom     = {
                                  - axisBorderShow    = false
                                  - axisCenteredZero  = false
                                  - axisColorMode     = "text"
                                  - axisLabel         = ""
                                  - axisPlacement     = "auto"
                                  - axisSoftMax       = 180
                                  - axisSoftMin       = 0
                                  - barAlignment      = 0
                                  - drawStyle         = "line"
                                  - fillOpacity       = 25
                                  - gradientMode      = "none"
                                  - hideFrom          = {
                                      - legend  = false
                                      - tooltip = false
                                      - viz     = false
                                    }
                                  - insertNulls       = false
                                  - lineInterpolation = "smooth"
                                  - lineWidth         = 1
                                  - pointSize         = 5
                                  - scaleDistribution = {
                                      - type = "linear"
                                    }
                                  - showPoints        = "auto"
                                  - spanNulls         = true
                                  - stacking          = {
                                      - group = "A"
                                      - mode  = "normal"
                                    }
                                  - thresholdsStyle   = {
                                      - mode = "dashed"
                                    }
                                }
                              - mappings   = []
                              - thresholds = {
                                  - mode  = "absolute"
                                  - steps = [
                                      - {
                                          - color = "green"
                                          - value = null
                                        },
                                      - {
                                          - color = "red"
                                          - value = 180
                                        },
                                    ]
                                }
                            }
                          - overrides = [
                              - {
                                  - matcher    = {
                                      - id      = "byName"
                                      - options = "Dormant users"
                                    }
                                  - properties = [
                                      - {
                                          - id    = "custom.fillOpacity"
                                          - value = 5
                                        },
                                    ]
                                },
                            ]
                        }
                      - gridPos         = {
                          - h = 8
                          - w = 11
                          - x = 0
                          - y = 0
                        }
                      - options         = {
                          - legend  = {
                              - calcs       = []
                              - displayMode = "list"
                              - placement   = "bottom"
                              - showLegend  = true
                            }
                          - tooltip = {
                              - mode = "single"
                              - sort = "none"
                            }
                        }
                      - targets         = [
                          - {
                              - column         = "active_user_count"
                              - connectionArgs = {
                                  - catalog  = "__default"
                                  - database = "__default"
                                  - region   = "__default"
                                }
                              - datasource     = {
                                  - type = "grafana-athena-datasource"
                                  - uid  = "${datasource}"
                                }
                              - format         = 0
                              - rawSQL         = <<-EOT
                                    SELECT "date", active_user_count as "Active users", total_user_count-active_user_count as "Dormant users" FROM "1password"."1password_service_adoption_metrics" order by "date" ASC
                                EOT
                              - refId          = "A"
                              - table          = "1password_service_adoption_metrics"
                            },
                        ]
  
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.